example_str = 'Кабачки полезны для здоровья.'

# Напишите свой код здесь.
print(example_str[0])
print(example_str[10])
print(example_str[1])
print(example_str[16])